import random
import questagAll
import damerau_levenshtein
import re
import datetime

month = datetime.datetime.now().strftime("%m")

g1 = ["အခုချိန် က မိုးရာသီ ဆိုတော့ ခရီးထွက်တာ တွေ တော့ သိပ်မရှိဘူး။ ဒါပေမယ့် အညာဒေသ ဖြစ်တဲ့ ပုဂံ၊ မုံရွာ၊ မန္တလေး စတဲ့ နေရာ မျိုးကို သွားလည်ကြတာ များ ပါတယ် ခင်ဗျ 😀️","အခုချိန်က မိုးရာသီ ဖြစ်တော့ ခရီးသိပ်သွားလို့ မကောင်းပါဘူး ခင်ဗျ 🙂️ အညာဒေသ ဖြစ်တဲ့ ပုဂံ၊ မုံရွာ၊ မန္တလေး စတဲ့ နေရာ မျိုးကိုတော့ သွားလည်ကြတာ များပါတယ် ... ","အခုလို မိုးရာသီ က ခရီးသွားရာသီ လည်း မဟုတ်တော့ သွားလို့ သိပ်ကောင်းမှာ မဟုတ်ဘူး။ ဒီအချိန် ကို ခရီးထွက်ချင်တယ် ဆိုရင်တော့ အညာဒေသတွေ ဖြစ်တဲ့ ပုဂံ တို့ မုံရွာ တို့ ဘက် သွားလည် ပါလား 🚐️"]
g2_sum = ["ဒီလို နွေရာသီ အချိန်မျိုး က ခရီးသွား ရာသီတစ်ခု ပဲ။ 🚎️ 🚐️ အခုလို ပူတဲ့ အချိန်မျိုး ဆို ကမ်းခြေဘက်တွေ ရေတံခွန် ဘက်တွေ သွားလည် ရင် အကောင်းဆုံး ပါပဲ😀️","ဒီအချိန် က ခရီးသွား ရာသီ ဆိုတော့ ခရီးထွက်ရတာ အကောင်းဆုံး အချိန်ပဲ မိသားစုနဲ့ ဆိုရင် ဘုရားဖူး ထွက် တာ၊ သူငယ်ချင်းတွေနဲ့ ဆိုရင် ကမ်းခြေတို့ ရေတံခွန်တို့ ကို သွားလည် ပါလား 🏄‍♀️️ 🤗️","အခုလို နွေရာသီ ကျောင်းပိတ်ရက်၊ အလုပ်ပိတ်ရက် မျိုး ဆိုတော့ ခရီးထွက်ဖို့ အကောင်းဆုံး အချိန်ပါပဲ ... မိသားစု 👨‍👩‍👧‍👧️ နဲ့ ဆိုရင် ဘုရားဖူးထွက်တာ သူငယ်ချင်းတွေ 👭️ နဲ့ ဆိုရင် ကမ်းခြေ တို့ ရေတံခွန် တို့ ကို သွားလည် ပါလား","အခု လို နွေရာသီ မှာ ဆို ရင် မိသားစု နဲ့ ဖြစ်ဖြစ် သူငယ်ချင်း နဲ့ ဖြစ်ဖြစ် Beach mode on တာ အကောင်းဆုံး ပါပဲ ခင်ဗျ 😆️ ❤️"]
g2_rain = ["အခုချိန် က မိုးရာသီ ဆိုတော့ ခရီးထွက်တာ တွေ တော့ သိပ်မရှိဘူး။ ဒါပေမယ့် အညာဒေသ ဖြစ်တဲ့ ပုဂံ၊ မုံရွာ၊ မန္တလေး စတဲ့ နေရာ မျိုးကို သွားလည်ကြတာ များ ပါတယ် ခင်ဗျ 😀️","အခုချိန်က မိုးရာသီ ဖြစ်တော့ ခရီးသိပ်သွားလို့ မကောင်းပါဘူး ခင်ဗျ 🙂️ အညာဒေသ ဖြစ်တဲ့ ပုဂံ၊ မုံရွာ၊ မန္တလေး စတဲ့ နေရာ မျိုးကိုတော့ သွားလည်ကြတာ များပါတယ် ... ","အခုလို မိုးရာသီ က ခရီးသွားရာသီ လည်း မဟုတ်တော့ သွားလို့ သိပ်ကောင်းမှာ မဟုတ်ဘူး။ ဒီအချိန် ကို ခရီးထွက်ချင်တယ် ဆိုရင်တော့ အညာဒေသတွေ ဖြစ်တဲ့ ပုဂံ တို့ မုံရွာ တို့ ဘက် သွားလည် ပါလား 🚐️"]
g2_win = ["အခုလို ဆောင်းရာသီ အချိန်မျိုး မှာ ဆိုရင် ပူတဲ့ဒေသတွေဘက်ကို ဘုရားဖူးထွက်တာ၊ အလည်အပတ်သွားတာတို့ အကောင်းဆုံး ပါပဲ 😊️","အခုလို ဆောင်းရာသီလိုမျိုး မှာ အေးတာကို ကြိုက်တဲ့လူတွေ အတွက် ဆိုရင် တောင်ကြီးတို့၊ ကျိုက်ထီးရိုးတို့ မြန်မာပြည်အထက်ပိုင်း စတဲ့ နေရာမျိုးတွေကို သွားလည်ပါလား ❤️"]

def greetCheck(data):
	mindist = 30
	maxdata = ""
	
	tag = '/home/pinky/chatbot-test/database/greeting'
	tagFile = open(tag,"r")
	tagline = tagFile.readlines()
	for tag in range(len(tagline)):
		f1con = tagline[tag].rstrip("\n").replace(" ","")
		f1con = f1con.lower()
		f1tmp = f1con.split("/")

		distance = damerau_levenshtein.damerau(data,f1tmp[0])
		if distance < mindist:
			mindist = distance
			maxdata = f1con
	print("Month: "+month)
	print("mindistance of greeting check: "+str(mindist))
	if mindist <= 10:
		if re.match(".*/g1",maxdata):
			return random.choice(g1)
		elif re.match(".*/g2",maxdata) and month == "03" or month == "04" or month == "05" or month == "06":
			return random.choice(g2_sum)
		elif re.match(".*/g2",maxdata) and month == "07" or month == "08" or month == "09" or month == "10":
			return random.choice(g2_rain)
		elif re.match(".*/g2",maxdata) and month == "11" or month == "12" or month == "01" or month == "02":
			return random.choice(g2_win)
